README.org
#+TITLE:     Org Macros
#+AUTHOR:    Fabrice Niessen
#+EMAIL:     (concat "fniessen" at-sign "pirilampo.org")
#+DESCRIPTION:
#+KEYWORDS:  org mode, macros
#+LANGUAGE:  en

#+PROPERTY: comments no
#+PROPERTY: eval     no
#+PROPERTY: noweb    yes
#+PROPERTY: tangle   org-macros.setup

#+SETUPFILE: org-macros.setup
#+SETUPFILE: ~/src/org-style/setup/bigblow-local-abs.setup

* Overview

** Description

Once you've cloned [[https://github.com/fniessen/org-macros][Org-macros]], many macros will be ready to use within your Org
files.

Below is a list of the macros currently available.

*** Basic formatting

- [[#bgcolor][bgcolor]] macro
- [[#color][color]] macro
- [[#highlight][highlight]] macro
- [[#loremipsum][loremipsum]] macro

*** Generic macros

- =chart= macro
- =recently-update= macro
- =tasklist= macro

*** Layout

- =info= macro
- =note= macro
- =tip= macro
- =warning= macro

*** Navigation and lists

- =children= macro (to display child pages)
- =toc= macro

* Macros

** Cookie                                                            :noexport:

#+begin_src org
# -*- mode: org; -*-
#+end_src

** Bgcolor macro
   :PROPERTIES:
   :CUSTOM_ID: bgcolor
   :END:

The =bgcolor= macro allows you to change the background color of a block of text.

*** Code

#+begin_src org
,#+MACRO: bgcolor @@html:<div style="background-color: $1;">$2</div>@@
#+end_src

*** Parameters

1. Color name or hexadecimal code
2. Text you want to color

*** Examples

{{{bgcolor(red, This information is important.)}}}
{{{bgcolor(#E0E0E0, This other isn't.)}}}

Common color names are supported by most Org exporters (HTML, LaTeX):

{{{bgcolor(red, red)}}}
{{{bgcolor(orange, orange)}}}
{{{bgcolor(yellow, yellow)}}}
{{{bgcolor(green, green)}}}
{{{bgcolor(blue, blue)}}}
{{{bgcolor(purple, purple)}}}
{{{bgcolor(violet, violet)}}}

You can also use hexadecimal color codes:

{{{bgcolor(#FF0000, #FF0000)}}}
{{{bgcolor(#00FF00, #00FF00)}}}
{{{bgcolor(#0000FF, #0000FF)}}}

*** See also

[[#color][color]] macro \\
[[#highlight][highlight]] macro

** Color macro
   :PROPERTIES:
   :CUSTOM_ID: color
   :END:

The =color= macro allows you to change the foreground color of inline text.

*** Code

#+begin_src org
,#+MACRO: color @@html:<span style="color: $1">$2</span>@@
#+end_src

*** Parameters

1. Color name or hexadecimal code
2. Text you want to color

*** Examples

{{{color(red, This information is important.)}}}
{{{color(#E0E0E0, This other isn't.)}}}

Common color names are supported by most Org exporters (HTML, LaTeX):

{{{color(red, red)}}}
{{{color(orange, orange)}}}
{{{color(yellow, yellow)}}}
{{{color(green, green)}}}
{{{color(blue, blue)}}}
{{{color(purple, purple)}}}
{{{color(violet, violet)}}}

You can also use hexadecimal color codes:

{{{color(#FF0000, #FF0000)}}}
{{{color(#00FF00, #00FF00)}}}
{{{color(#0000FF, #0000FF)}}}

*** See also

[[#bgcolor][bgcolor]] macro \\
[[#highlight][highlight]] macro

