README.html
<!-- <xml version="1.0"> -->
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">

<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
  <meta name="generator" content=
  "HTML Tidy for Cygwin (vers 1st September 2004), see www.w3.org" />

  <title>Org Macros</title><!-- 2014-01-22 Wed 22:09 -->
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
  <meta name="generator" content="Org-mode" />
  <meta name="author" content="Fabrice Niessen" />
  <meta name="keywords" content="org mode, macros" />
  <link rel="stylesheet" type="text/css" href=
  "file:///D:/Users/fni/src/org-style/styles/bigblow/css/htmlize.css" />
  <link rel="stylesheet" type="text/css" href=
  "file:///D:/Users/fni/src/org-style/styles/bigblow/css/bigblow.css" />
  <link rel="stylesheet" type="text/css" href=
  "file:///D:/Users/fni/src/org-style/styles/bigblow/css/hideshow.css" />






</head>

<body>
  <div id="content">
    <h1 class="title">Org Macros</h1>

    <div id="table-of-contents">
      <h2>Table of Contents</h2>

      <div id="text-table-of-contents">
        <ul>
          <li>
            <a href="#sec-1">1. Overview</a>

            <ul>
              <li>
                <a href="#sec-1-1">1.1. Description</a>

                <ul>
                  <li><a href="#sec-1-1-1">1.1.1. Basic formatting</a></li>

                  <li><a href="#sec-1-1-2">1.1.2. Generic macros</a></li>

                  <li><a href="#sec-1-1-3">1.1.3. Layout</a></li>

                  <li><a href="#sec-1-1-4">1.1.4. Navigation and lists</a></li>
                </ul>
              </li>
            </ul>
          </li>

          <li>
            <a href="#sec-2">2. Macros</a>

            <ul>
              <li>
                <a href="#bgcolor">2.1. Bgcolor macro</a>

                <ul>
                  <li><a href="#sec-2-1-1">2.1.1. Code</a></li>

                  <li><a href="#sec-2-1-2">2.1.2. Parameters</a></li>

                  <li><a href="#sec-2-1-3">2.1.3. Examples</a></li>

                  <li><a href="#sec-2-1-4">2.1.4. See also</a></li>
                </ul>
              </li>

              <li>
                <a href="#color">2.2. Color macro</a>

                <ul>
                  <li><a href="#sec-2-2-1">2.2.1. Code</a></li>

                  <li><a href="#sec-2-2-2">2.2.2. Parameters</a></li>

                  <li><a href="#sec-2-2-3">2.2.3. Examples</a></li>

                  <li><a href="#sec-2-2-4">2.2.4. See also</a></li>
                </ul>
              </li>

              <li>
                <a href="#sec-2-3">2.3. Error macro</a>

                <ul>
                  <li><a href="#sec-2-3-1">2.3.1. Code</a></li>

                  <li><a href="#sec-2-3-2">2.3.2. Parameters</a></li>

                  <li><a href="#sec-2-3-3">2.3.3. Examples</a></li>
                </ul>
              </li>

              <li>
                <a href="#highlight">2.4. Highlight macro</a>

                <ul>
                  <li><a href="#sec-2-4-1">2.4.1. Code</a></li>

                  <li><a href="#sec-2-4-2">2.4.2. Parameters</a></li>

                  <li><a href="#sec-2-4-3">2.4.3. Examples</a></li>

                  <li><a href="#sec-2-4-4">2.4.4. See also</a></li>
                </ul>
              </li>

              <li>
                <a href="#sec-2-5">2.5. Info macro</a>

                <ul>
                  <li><a href="#sec-2-5-1">2.5.1. Code</a></li>

                  <li><a href="#sec-2-5-2">2.5.2. Parameters</a></li>

                  <li><a href="#sec-2-5-3">2.5.3. Examples</a></li>
                </ul>
              </li>

              <li>
                <a href="#loremipsum">2.6. Loremipsum macro</a>

                <ul>
                  <li><a href="#sec-2-6-1">2.6.1. Code</a></li>

                  <li><a href="#sec-2-6-2">2.6.2. Parameters</a></li>

                  <li><a href="#sec-2-6-3">2.6.3. Examples</a></li>
                </ul>
              </li>

              <li>
                <a href="#sec-2-7">2.7. MiniPage macro</a>

                <ul>
                  <li><a href="#sec-2-7-1">2.7.1. Code</a></li>

                  <li><a href="#sec-2-7-2">2.7.2. Parameters</a></li>

                  <li><a href="#sec-2-7-3">2.7.3. Examples</a></li>
                </ul>
              </li>

              <li>
                <a href="#sec-2-8">2.8. NoPrint macro</a>

                <ul>
                  <li><a href="#sec-2-8-1">2.8.1. Code</a></li>

                  <li><a href="#sec-2-8-2">2.8.2. Parameters</a></li>

                  <li><a href="#sec-2-8-3">2.8.3. Examples</a></li>
                </ul>
              </li>

              <li>
                <a href="#sec-2-9">2.9. Warning macro</a>

                <ul>
                  <li><a href="#sec-2-9-1">2.9.1. Code</a></li>

                  <li><a href="#sec-2-9-2">2.9.2. Parameters</a></li>

                  <li><a href="#sec-2-9-3">2.9.3. Examples</a></li>
                </ul>
              </li>

              <li><a href="#sec-2-10">2.10. Others XXX</a></li>
            </ul>
          </li>
        </ul>
      </div>
    </div>

    <div id="outline-container-sec-1" class="outline-2">
      <h2 id="sec-1"><span class="section-number-2">1</span> Overview</h2>

      <div class="outline-text-2" id="text-1"></div>

      <div id="outline-container-sec-1-1" class="outline-3">
        <h3 id="sec-1-1"><span class="section-number-3">1.1</span>
        Description</h3>

        <div class="outline-text-3" id="text-1-1">
          <p>Once you’ve cloned <a href=
          "https://github.com/fniessen/org-macros">Org-macros</a>, many macros
          will be ready to use within your Org files.</p>

          <p>Below is a list of the macros currently available.</p>
        </div>

        <div id="outline-container-sec-1-1-1" class="outline-4">
          <h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Basic
          formatting</h4>

          <div class="outline-text-4" id="text-1-1-1">
            <ul class="org-ul">
              <li><a href="#bgcolor">bgcolor</a> macro</li>

              <li><a href="#color">color</a> macro</li>

              <li><a href="#highlight">highlight</a> macro</li>

              <li><a href="#loremipsum">loremipsum</a> macro</li>
            </ul>
          </div>
        </div>

        <div id="outline-container-sec-1-1-2" class="outline-4">
          <h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span>
          Generic macros</h4>

          <div class="outline-text-4" id="text-1-1-2">
            <ul class="org-ul">
              <li><code>chart</code> macro</li>

              <li><code>recently-update</code> macro</li>

              <li><code>tasklist</code> macro</li>
            </ul>
          </div>
        </div>

        <div id="outline-container-sec-1-1-3" class="outline-4">
          <h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span>
          Layout</h4>

          <div class="outline-text-4" id="text-1-1-3">
            <ul class="org-ul">
              <li><code>info</code> macro</li>

              <li><code>note</code> macro</li>

              <li><code>tip</code> macro</li>

              <li><code>warning</code> macro</li>
            </ul>
          </div>
        </div>

        <div id="outline-container-sec-1-1-4" class="outline-4">
          <h4 id="sec-1-1-4"><span class="section-number-4">1.1.4</span>
          Navigation and lists</h4>

          <div class="outline-text-4" id="text-1-1-4">
            <ul class="org-ul">
              <li><code>children</code> macro (to display child pages)</li>

              <li><code>toc</code> macro</li>
            </ul>
          </div>
        </div>
      </div>
    </div>

    <div id="outline-container-sec-2" class="outline-2">
      <h2 id="sec-2"><span class="section-number-2">2</span> Macros</h2>

      <div class="outline-text-2" id="text-2">
        <div class="org-src-container">
          <pre class="src src-org">
<span style="color: #8D8D84; font-style: italic;"># -*- mode: org; -*-</span>
</pre>
        </div>
      </div>

      <div id="outline-container-bgcolor" class="outline-3">
        <h3 id="bgcolor"><a id="sec-2-1" name="sec-2-1"></a><span class=
        "section-number-3">2.1</span> Bgcolor macro</h3>

        <div class="outline-text-3" id="text-bgcolor">
          <p>The <code>bgcolor</code> macro allows you to change the background
          color of a block of text.</p>
        </div>

        <div id="outline-container-sec-2-1-1" class="outline-4">
          <h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span>
          Code</h4>

          <div class="outline-text-4" id="text-2-1-1">
            <div class="org-src-container">
              <pre class="src src-org">
<span style=
"color: #008ED1; background-color: #EAEAFF;">#+MACRO: bgcolor @@html:&lt;div style="background-color: $1;"&gt;$2&lt;/div&gt;@@</span>
</pre>
            </div>
          </div>
        </div>

        <div id="outline-container-sec-2-1-2" class="outline-4">
          <h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span>
          Parameters</h4>

          <div class="outline-text-4" id="text-2-1-2">
            <ol class="org-ol">
              <li>Color name or hexadecimal code</li>

              <li>Text you want to color</li>
            </ol>
          </div>
        </div>

        <div id="outline-container-sec-2-1-3" class="outline-4">
          <h4 id="sec-2-1-3"><span class="section-number-4">2.1.3</span>
          Examples</h4>

          <div class="outline-text-4" id="text-2-1-3">
            <div style="background-color: red;">
              This information is important.
            </div>

            <div style="background-color: #E0E0E0;">
              This other isn't.
            </div>

            <p>Common color names are supported by most Org exporters (HTML,
            LaTeX):</p>

            <div style="background-color: red;">
              red
            </div>

            <div style="background-color: orange;">
              orange
            </div>

            <div style="background-color: yellow;">
              yellow
            </div>

            <div style="background-color: green;">
              green
            </div>

            <div style="background-color: blue;">
              blue
            </div>

            <div style="background-color: purple;">
              purple
            </div>

            <div style="background-color: violet;">
              violet
            </div>

            <p>You can also use hexadecimal color codes:</p>

            <div style="background-color: #FF0000;">
              #FF0000
            </div>

            <div style="background-color: #00FF00;">
              #00FF00
            </div>

            <div style="background-color: #0000FF;">
              #0000FF
            </div>
          </div>
        </div>

        <div id="outline-container-sec-2-1-4" class="outline-4">
          <h4 id="sec-2-1-4"><span class="section-number-4">2.1.4</span> See
          also</h4>

          <div class="outline-text-4" id="text-2-1-4">
            <p><a href="#color">color</a> macro<br />
            <a href="#highlight">highlight</a> macro</p>
          </div>
        </div>
      </div>

      <div id="outline-container-color" class="outline-3">
        <h3 id="color"><a id="sec-2-2" name="sec-2-2"></a><span class=
        "section-number-3">2.2</span> Color macro</h3>

        <div class="outline-text-3" id="text-color">
          <p>The <code>color</code> macro allows you to change the foreground
          color of inline text.</p>
        </div>

        <div id="outline-container-sec-2-2-1" class="outline-4">
          <h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span>
          Code</h4>

          <div class="outline-text-4" id="text-2-2-1">
            <div class="org-src-container">
              <pre class="src src-org">
<span style=
"color: #008ED1; background-color: #EAEAFF;">#+MACRO: color @@html:&lt;span style="color: $1"&gt;$2&lt;/span&gt;@@</span>
</pre>
            </div>
          </div>
        </div>
